# IFC_DMEnableObject

## Description
Enables/Disables the indicated object from current IFC Data Mapping.

```pascal
FUNCTION IFC_DMEnableObject(
				inStrObjName : STRING;
				bEnable      : BOOLEAN) : BOOLEAN;
```

```python

def vs.IFC_DMEnableObject(inStrObjName, bEnable):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING||
|bEnable|BOOLEAN||

## Version
Availability: from Vectorworks 2017
## Category
* IFC